// Lab9.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <windows.h>
#include<iomanip>
using namespace std;
#define N 9

int main()
{
	int arr[N][N];
	int prib = 1;

	for (int razn = 0; razn < N - 2; razn++)
	{

		for (int i = 0 + razn; i < N - razn; i++)
		{
			arr[0 + razn][i] = prib;
			prib++;
		}
		prib--;
		for (int i = 0 + razn; i < N - razn; i++)
		{

			arr[i][N - 1 - razn] = prib;
			prib++;
		}
		prib--;
		for (int i = N - 1 - razn; i >= 0 + razn;i--)
		{

			arr[N - 1 - razn][i] = prib;
			prib++;
		}
		for (int i = N - 1 - razn; i >= 1 + razn; i--)
		{

			arr[i][0 + razn] = prib;
			prib++;
		}

	}

	for (int i = 0; i < N; i++)
	{
		for (int j = 0;j < N;j++) {
			cout << setw(5) << arr[i][j];
		}
		cout << endl;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
