// Lab8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <math.h>
#include <windows.h>
#include <ctime>
#include <stdlib.h>
using namespace std;



int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int arr[200];
    /*int arr[] = {8,9,7,14,15,3,7,8,9};*/
    int length = 200;
    int count = 0;
    /* bool haveasub = false;*/ //Последовательность
    srand(time(0));
    for (int i = 0; i < length; i++)
    {
        arr[i] = rand() % 101;
        printf("%3d ", arr[i]);
    }
    cout << endl;

    for (int i = 1; i < length; i++)
    {
        if (arr[i] == arr[i - 1] + 1)
            /*{
                if (!haveasub)
                {
                    haveasub = true;
                }
            }
            else
            {
                if (haveasub)
                {*/
            count++;
        /* haveasub = false;
     }

 }

}
if (haveasub)
{
    count++;
}*/
    }
    printf("%d Количество последовательностей", count);
    return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
