// 3_A.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <iomanip>
#include <fstream>
#define M 5
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	int sum = 0;
	int size;
	cout << "Введите количество элементов массива:" << endl;
	cin >> size;
	int* mas = new int[size];
	for (int i = 0; i < size; i++)
	{
		*(mas + i) = rand() % 30 - 20;
		cout << setw(4) << *(mas+i);
	}
	cout << endl;
	string path = "Myfile.txt";
	ofstream fout;
	fout.open(path);
	if (!fout.is_open()) {
		cout << "Ошибка открытия файла" << endl;
	}
	else {
		for (int i = 0; i < size; i++)
		{
			fout << setw(4) << *(mas + i);
		}
	}
	fout.close();
	ifstream fin;
	fin.open(path);
	if (!fin.is_open()) {
		cout << "Ошибка открытия файла" << endl;
	}
	else {
		for (int i = 0; i < size; i++)
		{
			if (*(mas + i) < 0) {
				sum += *(mas + i);
			}
		}
		cout << "Сумма элументов:"<<sum;
	}
	fin.close();

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
/*fstream fout;
	fout.open("Myfile.txt");
	if (!fout.is_open()) {
		cout << "Ошибка открытия файла" << endl;
	}
	else {
		fout << "2+3=";
	}
	fout.close();*/