// RGZ.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include<stdlib.h>
#include<conio.h>
#include<iostream>
#include<windows.h>
#include<chrono>
#define N 45
using namespace std;

//гномья сортировка
int main() {
    auto start = std::chrono::high_resolution_clock::now();
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int A[N], i, tmp;

    for (i = 0;i < N;i++) {
        A[i] = rand() % 10;
        cout << A[i] << " ";
    }
    cout << endl;
    i = 0;
    while (i < N) {
        if (i == 0 || A[i - 1] <= A[i])
            i++;
        else {
            tmp = A[i];
            A[i] = A[i - 1];
            A[i - 1] = tmp;
            i--;
        }
       /* cout<<"Описание действия:"<<endl;

        for (int i = 0;i < N;i++)
            cout << A[i] << " ";
        cout << endl;*/
    }
    cout << "Конечный результат:" << endl;
    for (i = 0;i < N;i++)
        cout << A[i] << " ";
    cout << endl;
    auto end = std::chrono::high_resolution_clock::now();
    chrono::duration<float>duration = end - start;
    cout << "Продолжительность выполнения программы:" << duration.count() << endl;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
