// RGZ.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include<stdlib.h>
#include<conio.h>
#include<iostream>

using namespace std;

//главный функция(метод) программы в котором реализован метод гномьей сортировки
int main() {
    const int N = 10;
    int A[N], i, tmp;
    //randomize();

    for (i = 0;i < N;i++) {
        A[i] = rand() % 10;
        cout << A[i] << " ";
    }
    cout << endl;
    //алгоритм гномьей сортировки
    i = 0;
    while (i < N) {
        if (i == 0 || A[i - 1] <= A[i])
            ++i;
        else {
            tmp = A[i];
            A[i] = A[i - 1];
            A[i - 1] = tmp;
            --i;
        }
        // конец иттерации
        cout << '#';
        cout.width(2);
        cout << i << "# ";

        for (int i = 0;i < N;i++)
            cout << A[i] << " ";
        cout << endl;
    }

    for (i = 0;i < N;i++)
        cout << A[i] << " ";
    cout << endl;

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
