// Lab3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <math.h>
#include <windows.h>
#pragma warning(disable : 4996)

int main(void) {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    double x, y;
    double a = 2, b = 3, c = 4;
    double t1, t2;
    double ax;

    printf("Введите x, y > \n");
    scanf("%lf %lf", &x, &y);
    ax = a * x;
    /* if ( (ax + b) != 0 && a != 0 && tan(ax/2) >= 0 && cos(x * 3.14 / 180) != 0) */
    t1 = (c + y * log((x * y + a) / (ax + b)) * (ax + b)) / (pow(c, 2) * (ax + b));
    t2 = (sin(ax * 3.14 / 180) / (2 * a * pow(cos(x * 3.14 / 180), 2)) + 1 / (2 * a) * log(tan((a * x) / 2) * 3.14 / 180));
    printf("t1 = %lg\n", t1);
    printf("t2 = %lg\n", t2);
    /*}
    else {
        printf("Введите нормальные значения");
        }*/

    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
