// Lab 10A.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <windows.h>
using namespace std;
#include<iomanip>
#define M 3
char Sravnenie(float a, float b) {

	if (a > b) {
		return '>';
	}
	if (a < b) {
		return '<';
	}
	if (a = b) {
		return '=';
	}
}


int main(char x, char y, char z)

{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	//Числа для сравнения
	float a = 0;
	float b = 0;
	cout << "Введите 1 число для сравнения:" << endl;
	cin >> a;
	cout << "Введите 2 число для сравнения:" << endl;
	cin >> b;
	Sravnenie(a, b);
	cout << a << Sravnenie(a, b) << b;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
