// Lab1_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;


	int main()
	{
		int i, j, n, m;
		double a[100][100];
		//заполнение массива случайными числами
		cout << "Enter lines (1<n<=100) n="; cin >> n;
		cout << "Enter columns (1<m<=100) m="; cin >> m;
		for (i = 0; i < n; i++)
		{
			for (j = 0; j < m; j++)
			{
				a[i][j] = rand() % 9;
			}
		}
		//вывод массива на экран 
		for (i = 0; i < n; i++)
		{
			for (j = 0; j < m; j++)
				cout << a[i][j] << " ";
			cout << endl;
		}
		cout << endl;
		//вывод обновлённого массива на экран
		for (i = 0; i < n; i++)
		{
			for (j = 0; j < m; j++)
				cout << a[n - 1 - i][j] << " ";
			cout << endl;
		}
		system("pause");
		return 0;
	}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
