// Lab6B.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <windows.h>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	srand(time(0));
	int answ;
	int counttrue = 0; //Количество правильных
	for (int i = 0; i < 10; i++)
	{
		int a = rand() % 10 + 1;
		int b = rand() % 10 + 1;
		int c = a * b;
		cout << a << "*" << b << "=" << endl;
		cin >> answ;
		if (answ == c)
		{
			counttrue++;
		}
		else if (answ != c);
		{
			counttrue = counttrue + 0;
		}
	}

	cout << "Количество правильных ответов" << endl << counttrue << endl << "Ваша оценка" << endl << counttrue << endl;

	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
