// Lab5A.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <math.h>
#include <cmath>
#pragma warning (disable:4996)
#include <windows.h>

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    double a;
    double b;
    double c;
    double d;
    double l;
    double k;
    printf("Введите a");
    scanf("%lf", &a);
    printf("Введите b");
    scanf("%lf", &b);
    printf("Введите c");
    scanf("%lf", &c);
    d = b * b - 4 * a * c;
    if (d > 0)
    {
        l = ((-b) + sqrt(d)) / (2 * a);
        k = ((-b) - sqrt(d)) / (2 * a);
        printf("l=%lf\n", l);
        printf("k=%lf\n", k);
    }
    if (d == 0)
    {
        l = (-b / (2 * a));
        printf("l=%lf\n", l);
    }
    if (d < 0)
        printf("Корней нет");



    return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
